/*
Задача 4: Да се изведат на екрана числата от 10 до 1 в обратен ред.
 */
public class Task4 {
    public static void main(String[] args) {
        for (int i = 10; i > 0; i--) {
            System.out.println(i);
        }

    }
}
