/*
Задача 2: Да се изведат на екрана числат от -20 до 50.
 */
public class Task2 {
    public static void main(String[] args) {
        for (int i = -20; i <= 50; i++) {
            System.out.println(i);
        }
    }
}
